Reports/ОстаткиОбороты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>ОстаткиОбороты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОтчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОтчетаОстатки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоПартиям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВРазрезеДат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НулевыеОбороты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Enums/ТипОтчетаОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипОтчетаОстатки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Остатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обороты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ОстаткиОбороты/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	Если Элемент.ВыделенныйТекст = "Остатки" Тогда
		УстановитьТекущийВариант("ОстаткиБезПартий");
		Элементы.НачальнаяДата.Видимость = Ложь;
		Отчет.НачальнаяДата = Null;
		Элементы.РазрезДат.Видимость = Ложь;
		Элементы.ПоПартиям.Видимость = Истина;
		Элементы.НулевыеОбороты.Видимость = Ложь;
		ПередатьПараметрыВКомпоновщик();
	Иначе 
		УстановитьТекущийВариант("Обороты");
		Элементы.НачальнаяДата.Видимость = Истина;
		Элементы.РазрезДат.Видимость = Истина;
		Элементы.ПоПартиям.Видимость = Ложь;
		Элементы.НулевыеОбороты.Видимость = Истина;
		ПередатьПараметрыВКомпоновщик();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПоПартиямПриИзменении(Элемент)
	Если Отчет.ПоПартиям Тогда 
		УстановитьТекущийВариант("ОстаткиСПартиями"); 
	Иначе
		УстановитьТекущийВариант("ОстаткиБезПартий"); 
	КонецЕсли;
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура РазрезДатПриИзменении(Элемент)
	Если Отчет.ВРазрезеДат Тогда 
		УстановитьТекущийВариант("ОборотыПоДатам"); 
	Иначе
		УстановитьТекущийВариант("Обороты"); 
	КонецЕсли;
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура КонечнаяДатаПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура НачальнаяДатаПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПередатьПараметрыВКомпоновщик()
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода", Отчет.НачальнаяДата);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода", Отчет.КонечнаяДата);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Номенклатура", Отчет.Номенклатура);
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Склад", Отчет.Склад);
	Если ЗначениеЗаполнено(Отчет.Номенклатура) = Ложь  Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Ложь;
	Иначе
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = Истина;
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = Отчет.Номенклатура;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Склад) = Ложь Тогда
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Ложь;
	Иначе
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
		Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ПравоеЗначение = Отчет.Склад;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ТипОтчета = Перечисления.ТипОтчетаОстатки.Остатки;
	УстановитьТекущийВариант("ОстаткиБезПартий"); 
	Элементы.НачальнаяДата.Видимость = Ложь;
	Элементы.РазрезДат.Видимость = Ложь;
	Отчет.НачальнаяДата = Null;
	Отчет.КонечнаяДата = ТекущаяДатаСеанса();
	Элементы.ПоПартиям.Видимость = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПередатьПараметрыВКомпоновщик();
КонецПроцедуры

#КонецОбласти
